
## Plan Result (stg)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 20 to add, 3 to change, 20 to destroy.</code></pre>

* Update
  * module.data_gateway_vm[0].azurerm_windows_virtual_machine.winvm[0]
  * module.data_gateway_vm[1].azurerm_windows_virtual_machine.winvm[0]
  * module.finalsa_storage_account.azurerm_storage_account.storage_account
* Replace
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/fonts/bold-affa96571d-v2.woff&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/fonts/bold-b542beb274-v2.woff2&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/fonts/light-94a07e06a1-v2.woff2&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/fonts/light-f591b13f7d-v2.woff&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/favicon.ico&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/favicon.svg&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/govuk-crest-2x.png&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/govuk-crest.png&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/govuk-icon-180.png&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/govuk-icon-192.png&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/govuk-icon-512.png&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/govuk-icon-mask.svg&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/govuk-opengraph-image.png&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/manifest.json&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/css/govuk-frontend-5.2.0.min.css&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/css/govuk-frontend-5.2.0.min.css.map&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/css/main.css&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/js/b2c.js&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/js/govuk-frontend-5.2.0.min.js&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/js/govuk-frontend-5.2.0.min.js.map&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_storage_blob.b2c_config["b2c/views/assets/fonts/bold-affa96571d-v2.woff"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/bold-affa96571d-v2.woff" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "assets/fonts/bold-affa96571d-v2.woff" -> "b2c/views/assets/fonts/bold-affa96571d-v2.woff" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/bold-affa96571d-v2.woff" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/fonts/bold-b542beb274-v2.woff2"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/bold-b542beb274-v2.woff2" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "assets/fonts/bold-b542beb274-v2.woff2" -> "b2c/views/assets/fonts/bold-b542beb274-v2.woff2" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/bold-b542beb274-v2.woff2" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/fonts/light-94a07e06a1-v2.woff2"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/light-94a07e06a1-v2.woff2" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "assets/fonts/light-94a07e06a1-v2.woff2" -> "b2c/views/assets/fonts/light-94a07e06a1-v2.woff2" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/light-94a07e06a1-v2.woff2" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/fonts/light-f591b13f7d-v2.woff"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/light-f591b13f7d-v2.woff" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "assets/fonts/light-f591b13f7d-v2.woff" -> "b2c/views/assets/fonts/light-f591b13f7d-v2.woff" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/light-f591b13f7d-v2.woff" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/favicon.ico"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/favicon.ico" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "assets/images/favicon.ico" -> "b2c/views/assets/images/favicon.ico" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/favicon.ico" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/favicon.svg"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/favicon.svg" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "assets/images/favicon.svg" -> "b2c/views/assets/images/favicon.svg" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/favicon.svg" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/govuk-crest-2x.png"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-crest-2x.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "assets/images/govuk-crest-2x.png" -> "b2c/views/assets/images/govuk-crest-2x.png" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-crest-2x.png" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/govuk-crest.png"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-crest.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "assets/images/govuk-crest.png" -> "b2c/views/assets/images/govuk-crest.png" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-crest.png" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/govuk-icon-180.png"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-180.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "assets/images/govuk-icon-180.png" -> "b2c/views/assets/images/govuk-icon-180.png" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-180.png" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/govuk-icon-192.png"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-192.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "assets/images/govuk-icon-192.png" -> "b2c/views/assets/images/govuk-icon-192.png" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-192.png" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/govuk-icon-512.png"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-512.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "assets/images/govuk-icon-512.png" -> "b2c/views/assets/images/govuk-icon-512.png" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-512.png" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/govuk-icon-mask.svg"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-mask.svg" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "assets/images/govuk-icon-mask.svg" -> "b2c/views/assets/images/govuk-icon-mask.svg" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-mask.svg" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/govuk-opengraph-image.png"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-opengraph-image.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "assets/images/govuk-opengraph-image.png" -> "b2c/views/assets/images/govuk-opengraph-image.png" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-opengraph-image.png" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/manifest.json"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/manifest.json" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "assets/manifest.json" -> "b2c/views/assets/manifest.json" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/manifest.json" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/css/govuk-frontend-5.2.0.min.css"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/css/govuk-frontend-5.2.0.min.css" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "css/govuk-frontend-5.2.0.min.css" -> "b2c/views/css/govuk-frontend-5.2.0.min.css" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/css/govuk-frontend-5.2.0.min.css" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/css/govuk-frontend-5.2.0.min.css.map"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/css/govuk-frontend-5.2.0.min.css.map" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "css/govuk-frontend-5.2.0.min.css.map" -> "b2c/views/css/govuk-frontend-5.2.0.min.css.map" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/css/govuk-frontend-5.2.0.min.css.map" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/css/main.css"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/css/main.css" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "css/main.css" -> "b2c/views/css/main.css" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/css/main.css" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/js/b2c.js"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/js/b2c.js" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "js/b2c.js" -> "b2c/views/js/b2c.js" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/js/b2c.js" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/js/govuk-frontend-5.2.0.min.js"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/js/govuk-frontend-5.2.0.min.js" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "js/govuk-frontend-5.2.0.min.js" -> "b2c/views/js/govuk-frontend-5.2.0.min.js" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/js/govuk-frontend-5.2.0.min.js" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/js/govuk-frontend-5.2.0.min.js.map"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/js/govuk-frontend-5.2.0.min.js.map" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "js/govuk-frontend-5.2.0.min.js.map" -> "b2c/views/js/govuk-frontend-5.2.0.min.js.map" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/js/govuk-frontend-5.2.0.min.js.map" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.data_gateway_vm[0].azurerm_windows_virtual_machine.winvm[0] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "winvm" {
        id                                                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/dg-vm1-stg"
        name                                                   = "dg-vm1-stg"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (41 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_gateway_vm[1].azurerm_windows_virtual_machine.winvm[0] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "winvm" {
        id                                                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/dg-vm2-stg"
        name                                                   = "dg-vm2-stg"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (41 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.finalsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg"
        name                              = "prefinalsastg"
        tags                              = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (63 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "20.50.108.242",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 20 to add, 3 to change, 20 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":803,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->